Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Weblate could not resolve the repository destination. Check the hostname and the instance DNS configuration. Internal or otherwise non-public hosts must also be explicitly allowed by the instance administrator.
sv: Weblate kunde inte slå upp förrådsdestinationen. Kontrollera värdnamnet och instansens DNS-konfiguration. Interna eller på annat sätt icke-offentliga värdar måste dessutom uttryckligen godkännas av instansadministratören.

source: The repository URL redirect could not be safely followed. Configure the final repository URL directly; Weblate automatically accepts only verified permanent redirects on the same host.
sv: Förrådets URL:s omdirigering kunde inte följas säkert. Konfigurera direkt den slutliga URL:en till förrådet; Weblate accepterar automatiskt endast verifierade permanenta omdirigeringar på samma värd.

source: This repository does not allow forks. Ensure the Weblate GitHub App is connected to this workspace and has access to the repository, then migrate the component to push translation branches directly to the upstream repository.
sv: Det här arkivet tillåter inte förgreningar. Kontrollera att Weblate GitHub-appen är ansluten till arbetsytan och har åtkomst till arkivet och migrera sedan komponenten för att pusha översättningsgrenar direkt till uppströmsarkivet.

source: Migrate to GitHub App
sv: Migrera till GitHub-appen

source: Ask a workspace owner to complete the GitHub App setup and migration.
sv: Be en arbetsyteägare att slutföra konfigurationen och migreringen av GitHub-appen.

source: The GitHub repository allows only collaborators to create pull requests. Ask a repository maintainer to allow pull requests from all users or add <code>%(username)s</code> as a collaborator.
sv: GitHub-förrådet tillåter endast medarbetare att skapa pull-begäranden. Be en förrådsansvarig att tillåta pull-begäranden från alla användare eller att lägga till <code>%(username)s</code> som medarbetare.

source: The GitHub repository allows only collaborators to create pull requests. Ask a repository maintainer to allow pull requests from all users.
sv: GitHub-förrådet tillåter endast medarbetare att skapa pull-begäranden. Be en förrådsansvarig att tillåta pull-begäranden från alla användare.

source: The repository references Git LFS objects that are missing from the push destination. Weblate does not download or upload Git LFS objects, and files tracked by Git LFS cannot be used as translation files.
sv: Förrådet refererar till Git LFS-objekt som saknas från push-destinationen. Weblate hämtar inte ifrån och skickar inte till Git LFS-objekt, och filer som spåras av Git LFS kan inte användas som översättningsfiler.

source: You might want to turn on force push in the version control parameters of the component configuration to overwrite the remote repository after rebasing commits in Weblate.
sv: Du kanske vill slå på tvingande push i komponentkonfigurationens parametrar för versionshantering för att skriva över fjärrförrådet efter att ha ombaserat commit:er i Weblate.

source: Another component is configured to push to the same repository and push branch.
sv: En annan komponent är konfigurerad för att skicka upp till samma förråd och samma gren.

source: This can cause the branch to be overwritten.
sv: Det här kan orsaka att grenen skrivs över.

source: Use a different push branch for each component, or share the repository using the following Weblate URL:
sv: Använd en separat push-gren för varje komponent, eller dela förrådet via följande Weblate-URL:

source: Remove duplicate strings from %(language)s (%(filename)s)
sv: Ta bort duplicerade strängar från %(language)s (%(filename)s)

source: Remove duplicate strings
sv: Ta bort duplicerade strängar

source: This component updates the POT file automatically, but does not update the PO files.
sv: Denna komponent uppdaterar POT-filen automatiskt, men uppdaterar inte PO-filerna.

source: Install the msgmerge add-on as well if you want translation files to follow template changes automatically.
sv: Installera även tillägget msgmerge om du vill att översättningsfiler följer malländringar automatiskt.

source: This component can use the Weblate GitHub App for repository access and pull requests.
sv: Den här komponenten kan använda Weblate GitHub-appen för åtkomst till arkivet och pull requests.

source: This glossary has no remote repository, and ‘Manage strings’ is disabled. You cannot add glossary terms directly in Weblate, and terminology entries are not automatically added to missing glossary languages.
sv: Den här ordlistan har inget fjärrarkiv och ”Hantera strängar” är inaktiverat. Du kan inte lägga till ordlistetermer direkt i Weblate, och terminologiposter läggs inte automatiskt till för saknade ordlistespråk.

source: This glossary contains terms marked as terminology, but ‘Manage strings’ is disabled. Weblate will not automatically add these terms to missing glossary languages.
sv: Den här ordlistan innehåller termer markerade som terminologi, men ”Hantera strängar” är inaktiverat. Weblate lägger inte automatiskt till termerna för saknade ordlistespråk.

source: Enable ‘Manage strings’ in the component settings to add terms and synchronize terminology. You can dismiss this warning if the glossary files are maintained separately.
sv: Aktivera ”Hantera strängar” i komponentinställningarna för att lägga till termer och synkronisera terminologi. Du kan avfärda varningen om ordlistefilerna underhålls separat.

source: Include the following recommended topics:
sv: Ta med följande rekommenderade ämnen:

source: How contributors should submit translations.
sv: Hur bidragsgivare skall skicka in översättningar.

source: What review translators should expect.
sv: Vad granskningsöversättare skall förvänta sig.

source: How to report problems with source strings.
sv: Hur man rapporterar problem med källsträngar.

source: Where translations can be tested or when they are released.
sv: Var översättningar kan testas eller när de släpps.

source: No translations were found for this component file mask.
sv: Inga översättningar hittades för denna komponentfilmask.

source: This is okay when the repository does not contain translations yet.
sv: Detta är som det skall när förrådet ännu inte innehåller några översättningar.

source: The alert will disappear once translations are added in Weblate or committed to the repository.
sv: Varningen kommer att försvinna när översättningar läggs till i Weblate eller läggs in i förrådet.

source: If translations already exist, check whether the file mask <code>%(filemask)s</code> matches files in your version control system repository.
sv: Om det redan finns översättningar, kontrollera huruvida filmasken <code>%(filemask)s</code> stämmer överens med filerna i ditt versionshanteringssystems förråd.

source: Weblate could not recover an interrupted repository operation.
sv: Weblate kunde inte återställa en avbruten åtgärd i förrådet.

source: Reset the repository
sv: Återställ förrådet

source: The glossary contains languages not used by any regular component in this project.
sv: Ordlistan innehåller språk som inte används av någon vanlig komponent i detta projekt.

source: Remove the glossary language if it is no longer needed, or add matching translations to regular components if the glossary should be used.
sv: Ta bort språket i ordlistan om det inte längre behövs, eller lägg till motsvarande översättningar i de vanliga komponenterna om ordlistan ska användas.

source: From GitHub
sv: Från GitHub

source: Pick a repository from a connected account. The component creation form will be pre-filled with the clone URL, default branch, and matching VCS driver.
sv: Välj ett förråd från ett anslutet konto. Formuläret för att skapa komponenter kommer att vara förifyllt med klonings-URL:en, standardgrenen och motsvarande VCS-drivrutin.

source: Add or configure account
sv: Lägg till eller konfigurera ett konto

source: Branch
sv: Gren

source: No repositories available yet. Connect a code-hosting account to make repositories available here.
sv: Inga förråd är tillgängliga ännu. Anslut ett konto för en kodlagringsvärd för att göra förråd tillgängliga här.

source: No repositories are available from connected accounts for this project workspace.
sv: Det finns inga förråd tillgängliga från anslutna konton för detta projektarbetsområde.

source: Select a project with a workspace to connect an account or import repositories from an existing connection.
sv: Välj ett projekt med en arbetsyta för att koppla ett konto till eller importera förråd från en befintlig anslutning.

source: If this action removes restricted components, retained translation memory from them will become available according to the project and workspace translation memory access rules unless you also delete it.
sv: Om denna åtgärd tar bort begränsade komponenter kommer översättningsminnet som lagrats från dessa att bli tillgängligt i enlighet med reglerna för åtkomst till översättningsminnet för projektet och arbetsområdet, såvida du inte också raderar det.

source: The “Add missing languages” add-on is installed on this component, a removed language might be re-added by it again.
sv: Tillägget 'Lägg till saknade språk' är installerat på den här komponenten vilket kan göra att ett borttaget språk kanske läggs till igen.

source: The exported Weblate repository can be shallow by default, so this workflow works best from an up-to-date upstream checkout. Cloning from the exported Weblate repository or using an outdated upstream checkout can fail even when Weblate and upstream are in sync. See the FAQ below for details.
sv: Det exporterade Weblate-förrådet kan som standard vara ”shallow”, så det här arbetsflödet fungerar bäst utifrån en uppdaterad upphämtning från uppströms. Att klona från det exporterade Weblate-förrådet eller använda en föråldrad upphämtning från uppströms kan misslyckas även om Weblate och uppströms är synkroniserade. Se vanliga frågor och svar nedan för mer information.

source: Leave the language limit empty to grant access to all languages available to the team. Select languages only to apply an additional filter.
sv: Låt språkbegränsningen vara tom för att ge åtkomst till alla språk som är tillgängliga för gruppen. Välj endast språk för att använda ett ytterligare filter.

source: No teams are available.
sv: Det finns inga grupper tillgängliga.

source: Choose which contributions by <b>%(user)s</b> to clean up in this project.
sv: Välj vilka bidrag från <b>%(user)s</b> som skall rensas bort i det här projektet.

source: Learn more about pushing changes from Weblate.
sv: Läs mer om att skicka ändringar från Weblate.

source: Search results stay fixed while you translate. Refresh results to show strings matching the filters now.
sv: Sökresultaten är fasta medan du översätter. Uppdatera resultaten för att visa strängar som nu matchar filtren.

source: You do not have permission to add suggestions.
sv: Du har inte behörighet att lägga till förslag.

source: Search translation memory
sv: Sök i översättningsminnet

source: No matching machine translations found.
sv: Inga matchande maskinöversättningar hittades.

source: Source:
sv: Källa:

source: Context:
sv: Kontext:

source: Remove selected translation memory entries
sv: Ta bort valda poster i översättningsminnet

source: This string was translated automatically.
sv: Denna sträng översattes automatiskt.

source: This string was translated automatically using %(author)s.
sv: Denna sträng översattes automatiskt med %(author)s.

source: Browse glossary
sv: Bläddra i ordlistan

source: Add existing screenshot
sv: Lägg till befintlig skärmbild

source: Upload screenshot
sv: Ladda upp skärmbild

source: <code>%(flags)s</code> is inherited from %(object)s because editing source strings is not available for bilingual formats.
sv: <code>%(flags)s</code> ärvs från %(object)s eftersom redigering av källsträngar inte är tillgängligt för tvåspråkiga format.

source: <code>%(flags)s</code> is inherited from %(object)s because editing source strings is not available for %(format)s.
sv: <code>%(flags)s</code> ärvs från %(object)s eftersom redigering av källsträngar inte är tillgängligt för %(format)s.

source: <code>%(flags)s</code> is inherited from %(object)s because editing source strings is disabled.
sv: <code>%(flags)s</code> ärvs från %(object)s eftersom redigering av källsträngar är inaktiverat.

source: You do not manage any workspaces. VCS accounts can be connected only to workspaces you manage.
sv: Du förvaltar inga arbetsområden. VCS-konton kan endast kopplas till arbetsområden som du förvaltar.

source: No code-hosting connections are available. A site administrator needs to register a code-hosting app first.
sv: Det finns inga anslutningar till kodvärdar tillgängliga. En webbplatsadministratör måste först registrera ett program för en kodvärd.

source: Connect code-hosting accounts to %(workspace)s. These accounts can then be used when creating components from version control.
sv: Anslut konton för kodvärd till %(workspace)s. Dessa konton kan sedan användas när man skapar komponenter från versionskontroll.

source: Connect code-hosting accounts to workspaces you manage. These accounts can then be used when creating components from version control.
sv: Anslut kodvärdskonton till arbetsområden som du förvaltar. Dessa konton kan sedan användas när man skapar komponenter från versionskontroll.

source: Code-hosting app
sv: Kodvärdsprogram

source: Not registered
sv: Ej registrerat

source: Code-hosting app credentials are not registered for %(hostname)s. Existing connected accounts can be removed, but new accounts cannot be connected until a site administrator registers the app again.
sv: Kodvärdsprogrammets inloggningsuppgifter är inte registrerade för %(hostname)s. Befintliga anslutna konton kan tas bort, men nya konton kan inte kopplas upp förrän en webbplatsadministratör registrerar programmet igen.

source: Connect accounts
sv: Anslut konton

source: Connect GitHub account
sv: Anslut GitHub-konto

source: Connected accounts
sv: Anslutna konton

source: Provider ID
sv: Leverantörs-ID

source: No connected accounts yet.
sv: Inga anslutna konton ännu.

source: Code-hosting integrations
sv: Integreringar med kodvärdar

source: Migrate %(workspace_name)s to the Weblate GitHub App
sv: Migrera %(workspace_name)s till Weblate GitHub-appen

source: Connect or update GitHub account
sv: Anslut eller uppdatera GitHub-konto

source: Select existing Git or GitHub components to use the Weblate GitHub App. Their repository URLs will be replaced by canonical HTTPS URLs, and separate push URLs will be removed.
sv: Välj befintliga Git- eller GitHub-komponenter som ska använda Weblate GitHub-appen. Deras arkiv-URL:er ersätts av kanoniska HTTPS-URL:er och separata push-URL:er tas bort.

source: The GitHub App needs repository access for these accounts: %(accounts)s.
sv: GitHub-appen behöver åtkomst till arkiv för följande konton: %(accounts)s.

source: Connected GitHub accounts:
sv: Anslutna GitHub-konton:

source: Refresh repositories
sv: Uppdatera förråd

source: Migrate selected components
sv: Migrera valda komponenter

source: Connect or update the GitHub App to grant access to the remaining repositories.
sv: Anslut eller uppdatera GitHub-appen för att ge åtkomst till återstående arkiv.

source: Connect the GitHub App to the listed accounts and grant access to their repositories before migrating.
sv: Anslut GitHub-appen till de angivna kontona och ge åtkomst till deras arkiv före migreringen.

source: A workspace owner needs to connect the GitHub App and grant access to these repositories before they can be migrated.
sv: En arbetsyteägare måste ansluta GitHub-appen och ge åtkomst till dessa arkiv innan de kan migreras.

source: Migration status
sv: Migrationsstatus

source: Repository access needed
sv: Åtkomst till arkiv krävs

source: There are no GitHub components in this workspace that can be migrated.
sv: Det finns inga GitHub-komponenter i arbetsytan som kan migreras.

source: Register Weblate GitHub App
sv: Registrera Weblateprogrammet på GitHub

source: Submit the form below to create a GitHub App with all the permissions and events Weblate needs already filled in. After you confirm the App's name on GitHub, you will be redirected back here and the credentials will be stored automatically.
sv: Skicka in formuläret nedan för att skapa ett GitHub-programmet där alla behörigheter och händelser som Weblate behöver redan är ifyllda. När du har bekräftat programmets namn på GitHub kommer du att omdirigeras tillbaka hit och inloggningsuppgifterna sparas automatiskt.

source: The <code>%(host)s</code> host already has stored GitHub App credentials. You can edit the form, but submitting this host again will be rejected.
sv: Värden <code>%(host)s</code> har redan lagrade inloggningsuppgifter för GitHub-programmet. Du kan redigera formuläret, men att skicka in denna värd igen kommer att avvisas.

source: GitHub hosts that already have a Weblate GitHub App registered:
sv: GitHub-värdar som redan har ett Weblate GitHub-program registrerat:

source: Subscribed events
sv: Händelser prenumererade på

source: Continue to GitHub
sv: Fortsätt till GitHub

source: Manifest preview
sv: Förhandsgranskning av manifestet

source: The JSON document below is the manifest that GitHub will use to pre-fill the new App's settings.
sv: JSON-dokumentet nedan är det manifest som GitHub kommer att använda för att förifylld inställningarna för det nya programmet.

source: Sending you to %(host)s
sv: Skickar dig till %(host)s

source: Click the button below to send the pre-filled GitHub App manifest to %(host)s. You will be redirected back here once GitHub confirms.
sv: Klicka på knappen nedan för att skicka det förifyllda GitHub-program-manifestet till %(host)s. Du kommer att omdirigeras tillbaka hit när GitHub bekräftar.

source: GitHub host
sv: GitHub-värd

source: App name
sv: Programnamn

source: Continue to %(host)s
sv: Fortsätt till %(host)s

source: GitHub only shows accounts where your GitHub user can install or request this app. If an organization is missing, check your organization role and GitHub App installation restrictions in GitHub.
sv: GitHub visar bara konton där din GitHub-användare kan installera eller begära den här appen. Om en organisation saknas, kontrollera din organisationsroll och installationsbegränsningar för GitHub-appen i GitHub.

source: Choose GitHub host
sv: Välj GitHub-värd

source: Select the GitHub or GitHub Enterprise instance where you want to connect the Weblate GitHub App.
sv: Välj den GitHub- eller GitHub Enterprise-instans där du vill ansluta Weblate GitHub-appen.

source: Install on %(hostname)s
sv: Installera på %(hostname)s

source: Connected GitHub account: %(login)s
sv: Anslutet GitHub-konto: %(login)s

source: Weblate GitHub app credentials are not registered for %(hostname)s. Token refresh and webhook signature checks will not work until the App credentials are registered again.
sv: Weblate GitHub-appens inloggningsuppgifter är inte registrerade för %(hostname)s. Tokenuppdatering och webhook-signaturkontroller fungerar inte förrän appens inloggningsuppgifter är registrerade igen.

source: GitHub installation ID
sv: GitHub-installations-ID

source: Repositories updated
sv: Förråden uppdaterade

source: Available Repositories
sv: Tillgängliga förråd

source: Unavailable
sv: Inte tillgängligt

source: No repositories found. Click 'Refresh repositories' to fetch the list from GitHub.
sv: Inga arkiv hittades. Klicka på "Uppdatera arkiv" för att hämta listan från GitHub.

source: Weblate GitHub Apps
sv: Weblate GitHub-appar

source: No code-hosting app is registered yet. Use the button above to create one with the right permissions and webhook URL already filled in — Weblate will store the credentials automatically once GitHub redirects back.
sv: Ingen kodhostingsapp är registrerad ännu. Använd knappen ovan för att skapa en med rätt behörigheter och en webhook-URL som redan är ifylld – Weblate kommer att lagra inloggningsuppgifterna automatiskt när GitHub omdirigerar tillbaka.

source: The apps below provide credentials Weblate uses to talk to code hosting providers. Connect an account to each app to import repositories from that account.
sv: Apparna nedan tillhandahåller inloggningsuppgifter som Weblate använder för att kommunicera med kodvärdsleverantörer. Koppla ett konto till varje app för att importera arkiv från det kontot.

source: Remove app
sv: Ta bort programmet

source: Remove connected accounts first.
sv: Ta bort anslutna konton först.

source: Remove Weblate GitHub App?
sv: Ta bort Weblate GitHub-appen?

source: This deletes the stored credentials for the <code>%(slug)s</code> App on <code>%(host)s</code>.
sv: Detta raderar de lagrade inloggningsuppgifterna för <code>%(slug)s</code>-appen på <code>%(host)s</code>.

source: The App itself stays installed on GitHub. Delete it from GitHub separately if you no longer need it.
sv: Själva appen förblir installerad på GitHub. Ta bort den separat från GitHub om du inte längre behöver den.

source: No connected accounts yet. Use the button above to connect an organization or user account.
sv: Inga anslutna konton ännu. Använd knappen ovan för att ansluta ett organisations- eller användarkonto.

source: From connected account
sv: Från anslutet konto

source: Import from connected account
sv: Importera från anslutet konto

source: Select a repository to import. This will pre-fill the component creation form with the repository URL and branch.
sv: Välj ett arkiv att importera. Detta kommer att förfylla formuläret för att skapa komponenter med arkivets URL och gren.

source: No repositories available from connected accounts.
sv: Inga arkiv tillgängliga från anslutna konton.

source: Install the Weblate GitHub app to connect an organization or user account.
sv: Installera Weblate GitHub-appen för att ansluta en organisation eller ett användarkonto.

source: Select a project with a workspace before connecting an account. Code-hosting accounts are connected to workspaces.
sv: Välj ett projekt med en arbetsyta innan du ansluter ett konto. Kodvärdkonton är anslutna till arbetsytor.

source: Weblate GitHub app is not registered on this Weblate instance.
sv: Weblate-programmet på GitHub är inte registrerat på denna Weblate-instans.

source: Try refreshing the repository list.
sv: Försök att uppdatera listan över förråd.

source: Remove connected account?
sv: Ta bort anslutet konto?

source: This removes the connected account <code>%(login)s</code> from Weblate.
sv: Detta tar bort det anslutna kontot <code>%(login)s</code> från Weblate.

source: If no other Weblate workspace uses this connection, the Weblate GitHub App will also be uninstalled from GitHub. Reconnecting it then requires installing the app on GitHub again.
sv: Om ingen annan Weblate-arbetsyta använder anslutningen avinstalleras även Weblate GitHub-appen från GitHub. För att återansluta den måste appen då installeras på GitHub igen.

source: Browse all workspace changes
sv: Bläddra bland alla ändringar i arbetsområdet

source: The workspace cannot be removed while it contains projects. Move or remove the projects first.
sv: Arbetsytan kan inte tas bort medan den innehåller projekt. Flytta eller ta bort projekten först.

source: A workspace associated with billing cannot be removed.
sv: En arbetsyta som är kopplad till fakturering kan inte tas bort.

source: I understand the consequences, delete this workspace
sv: Jag är medveten om konsekvenserna, a bort det här arbetsområdet
